package lesson4_homework;

/**
 * Created by letsk on 05/27/2017.
 */
public class HomeWorkDescription {
    /*
    1. Класс Число
Написать класс число (hw2.Number), выполняющий следующие операции:
— получение примитива (метод int get())
— сложение (метод Number add(Number num))
— вычитание (метод Number sub(Number num))
— умножение (метод Number mul(Number num))
— деление (метод Number div(Number num))
— возведение в степень (метод Number pow(Number exponent))
— вычисление факториала (метод Number fact())
— вычисление остатка от деления (метод Number mod(Number num))

2. Класс Дробь
Написать класс дробь (hw2.Fraction), выполняющий следующие действия:
— сложение дробей (метод Fraction add(Fraction frac))
— вычитание (метод Fraction sub(Fraction frac))
— умножение (метод Fraction mul(Fraction frac))
— деление (метод Fraction div(Fraction frac))
— приведение к строке(метод String toString())
— вывод (метод void print())

3. Приложение Калькулятор
Написать калькулятор (класс hw2.ConsoleCalc) в виде консольного меню:
— сложение двух чисел
— вычитание двух чисел
— умножение двух чисел
— деление двух чисел

4 Приложение Фирма
Написать класс фирма (hw2.Firm), содержащий имя, адрес, заплатанный счет (сумма), сотрудников.
У каждого сотрудника (hw2.Employee) есть имя, фамилия, ставка зарплаты (сумма), его личный
карточный счет (сумма), год поступления на работу, месяц поступления на работу, пол, отдел.
Класс фирма должен выполнять следующие функции:
— Вывести всех сотрудников фирмы на экран (метод void printAllEmployees())
— Вывести на экран всех сотрудников, отсортированных по зарплате (шейкерным методом)
— Выдать всем сотрудникам зарплату (перевести на карточный счет каждого сотрудника, сумму равную зарплате сотрудника,
с главного счета фирмы) (метод void giveSalaryForAll())
— Пересчитать всем сотрудникам дни отпуска (всем кто проработал больше 6 месяцев, по 2 дня за каждый отработанный месяц) (метод void calcVocations())
     */
}
