package lesson6_homework;

/**
 * Created by letsk on 05/27/2017.
 */
public class HomeWorkDescription {
    /*
3. Создайте интерфейс описывающий учебную группу студентов (с возможностью зачисления студентов в группу, удаления студента из группы),
и не основании его создайте класс Группа — который содержит массив из 10 объектов класса студент. Реализуйте метод поиска студента по фамилии.
В случае попытки добавления 11 студента вывести ошибку что группа переполнена.

4. Усовершенствуйте класс Group добавив возможность интерактивного добавления объекта.

5*. Реализуйте возможность сортировки списка студентов по фамилии.

6*. Реализуйте возможность перевода студента из одной группы в другую группу.

[5/30/2017 9:45:44 PM] Well: 1. Классы Cat и Animal.
Создать класс Кошка на основе класса Животное.
Кошка должна уметь:
— Вывести на экран имя, метод void printName()
— Подать голос, метод void say()
— Поднимать шерсть дыбом, метод void riseHair()
— Питаться, метод void eat()
— Орать если ненаелась, метод void yellIfNotGorged()
В классе Animal должны быть описаны базовые признаки которые
свойствены всем животным.

2.Создать класс Самолет на основе класса Крыло.
Классы Plane и Wing.
Самолет должен уметь:
— Взлетать (это возможно если в обоих крыльях достаточно топлива для взлета,
которое тратится при взлете, метод void takeoff())
— Задавать маршрут (маршрут состоит из последовательности координат,
метод void selectRoute(int[][] coordinates))
— Вывести на экран маршрут, метод void printRoute()

3. Создать класс Рыба на основе класса «Продукт в супермаркете».
Классы Fish и Product.
Рыба должна уметь:
— Вывести свою цену, метод void printPrice()
— Вывести срок хранения, метод void printStoragePeriod()
— Проплыть, метод void swim()
— Проглотить другую рыбу, метод void cannibalism(Fish fish)
— Вывести свой штрих-код и цену, метод void printBarAndPrice()

4*. Улучшаем фирму:
Написать систему управления предприятием:
Сотрудники:
На фирме должны работать следующие сотрудники:
— Обычный сотрудник
— Фамилия
— Имя
— Отчество
— Пол
— Дата рождения
— Ставка зарплаты
— Зарплатный счет
— Стаж
— Дни отпуска
— Дата последнего отпуска
— Отдел

— получение размера зарплаты

Менеджер (отдел, подчиненные, зп + по 50 за подчененного)
Продавец (продажи, зп + 30% от продаж)
Фирма:
— сотрудники
— счет
— вывести всех сотрудников на экран
— вывести всех сотрудников, отсортированных по зп
— вывести всех сотрудников, отсортированных по фамилии
— всем продавцам продать на сумму 10000
— выдать всем зарплату (если не хватает, выдать сколько есть)
— пересчитать всем отпуска (после 6 мес, по 2 дня в месяц)
— поднять жалование на 10% всем сотрудникам со стажем > 5 лет
-* выдать праздничный бонус 20% (если сегодня 8 марта — женщинам,
если 23 февраля мужчинам)
-* сокращение — уволить всех со стажем < 6 мес и нечетной
датой рождения, зарплату увольняемого разделить между
всеми коллегами по отделу
-* нанять сотрудника, снять с зарплаты сотрудников отдела зарплату для новичка
-* после любой изменяющей операции сохранять фирму в файл
*/
}
