package lesson6_homework.enterprise;

/**
 * Created by letsk on 06/11/2017.
 */
public class Main {

    public static void main(String[] args) {
        //Employee employee = new Employee();

    }
    /* Написать систему управления предприятием:
Сотрудники:
На фирме должны работать следующие сотрудники:
— Обычный сотрудник
— Фамилия
— Имя
— Отчество
— Пол
— Дата рождения
— Ставка зарплаты
— Зарплатный счет
— Стаж
— Дни отпуска
— Дата последнего отпуска
— Отдел

— получение размера зарплаты

Менеджер (отдел, подчиненные, зп + по 50 за подчененного)
Продавец (продажи, зп + 30% от продаж)
Фирма:
— сотрудники
— счет
— вывести всех сотрудников на экран
— вывести всех сотрудников, отсортированных по зп
— вывести всех сотрудников, отсортированных по фамилии
— всем продавцам продать на сумму 10000
— выдать всем зарплату (если не хватает, выдать сколько есть)
— пересчитать всем отпуска (после 6 мес, по 2 дня в месяц)
— поднять жалование на 10% всем сотрудникам со стажем > 5 лет
-* выдать праздничный бонус 20% (если сегодня 8 марта — женщинам,
если 23 февраля мужчинам)
-* сокращение — уволить всех со стажем < 6 мес и нечетной
датой рождения, зарплату увольняемого разделить между
всеми коллегами по отделу
-* нанять сотрудника, снять с зарплаты сотрудников отдела зарплату для новичка
-* после любой изменяющей операции сохранять фирму в файл */
}
