package lesson4;

/**
 * Created by dell on 5/23/2017.
 */
public class HomeWorkDescription {

    /*
    1. Создаем классы с конструкторами:

  Phone:

- Модель телефона (String)

- Сим-карта       (SimCard)

   SimCard:

- Баланс (Integer)

- Тариф  (Integer)

   Contact:

- ФИО            (String)

- Номер телефона (Integer)




2. Добавить геттеры и сетерры SimCard

   и класс Phone, в класс Contact

   добавить только геттеры.




3. В классе Phone, реализовать метод

   пополнения баланса на сим-карте

   public void refillBalance(Integer money);




4. В класс Phone, добавить телефонную книгу.

   Реализовать метод добавления нового контакта

   в телефонную книгу. (Коллекция либо массив)

   public void newContact(String name, Integer phone);




5. В классе Phone, добавить метод который отобразит

   все контакты которые находятся в телефонной книге.

   public void showContacts();




6*. Реализовать в классе Phone метод совершения

    звонка на произвольный номер телефона из

    телефонной книги контактов. Учитывать при

    совершении звонка поминутную тарификацию, и

    списание денег со счета звонящего абонента.

    - Добавить проверку на отрицательный баланс,

      в случае если не хватило денег прервать вызов.

    - Если номеров нет, звонок не совершаем.

    public void randomCall(Integer minutes);
     */

}
